Autodesk.Revit.DB.FamilySymbolFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to find all family symbols of the given family.
familyId:
The family id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The familyId is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011